{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"title":"Cityman: City Management System","date":"2019-25-04"},"html":"<h1>CityMan - Sustainable City Management System</h1>\n<p>A mobile first and responsive web application with a decentralised and distributed architecture for managing Dublin Bikes, Dublin Bus and Luas. The application uses Django on the server side, Google Cloud Platform’s PostgreSQL database service for database, and Flask, uWSGI and Nginx for prediction microservices. Developed using Agile framework of Extreme Programming, it uses Bootstrap V4.0 for styling and interactivity, Bokeh Python library for analytics, Folium for map rendering which internally uses Leaflet.js for final map delivery, and is deployed on Google Cloud Platform.</p>\n<h2>Requirements</h2>\n<p>Compute engine ( Any UNIX flavor machine ) with Python 3 installed\nPostgres installed</p>\n<h2>DB setup</h2>\n<p>after downloading the SQL dump (dump.sql) run below command to setup db ( postgres should be installed in the system):\npsql -U postgres -W -f dump.sql\nit will ask for a password, please use \"citymangroup6\"</p>\n<h2>Source code setup</h2>\n<p>clone the code repository using below command:\ngit clone <a href=\"https://github.com/a2zarslaan/cityman.git\">https://github.com/a2zarslaan/cityman.git</a></p>\n<h2>To run the server run below command</h2>\n<p>pip install requirements.txt\npython manage.py runserver</p>\n<p>it will start the server locally</p>\n<h2>To set up data Aggregators:</h2>\n<p>-- run the following command: crontab -e</p>\n<p>it will open a file add below three lines in it:</p>\n<ul>\n<li>\n<ul>\n<li>\n<ul>\n<li>\n<ul>\n<li>\n<ul>\n<li>python3 <Path to cityman folder>/Aggregators/data_aggregator.py</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>\n<ul>\n<li>\n<ul>\n<li>\n<ul>\n<li>python3 <Path to cityman folder>/Aggregators/luas<em>real<em>time.py\n*/10\\</em> \\</em> * * python3 <Path to cityman folder>/Aggregators/dart<em>real</em>time.py</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>","excerpt":"CityMan - Sustainable City Management System A mobile first and responsive web application with a decentralised and distributed architecture…"}},{"node":{"frontmatter":{"title":"Tour Agency Concept","date":"2020-03-01"},"html":"<h1>Tour Agency Concept Website</h1>\n<p>This project aims at developing a responsive e-commerce website of a tour company from scratch, using SASS. It is a concept project, and uses no CSS libraries for any aspect of the project, from grid system to the animations. The whole layout and animations are developed using inbuilt features of CSS.</p>\n<h2>Motivation</h2>\n<p>The motivation behind this project was to strengthen and refresh my CSS skills and get well versed with the latest industry techniques and workflows. This was the most important factor leading to the decision of using only Vanilla CSS along with the CSS pre-processor called SCSS. This project was inspired by <a href=\"https://www.udemy.com/course/advanced-css-and-sass/\">Jonas Schmedtmann's Advanced CSS Course on Udemy</a>. The code is extremely organised, commented out and well-structured, so that it can further be used by developers as a CSS primer.</p>\n<h2>Technologies Used</h2>\n<p>The project features the use of industry standard BEM (Block Element Modifier) methodology which was used for structuring the project, the CSS 7-1 Architecture for a more manageable codebase, and SASS features such as mixins, variables and partials. Also, the project involves the development of custom grid system which is coded and commented out in the HTML file for the reader's reference. This grid system is used throughout the project for content layout. The site includes the use of advanced media queries for responsive behavior that supports almost all of the popular screen sizes. Further, the project demonstrates use of advanced responsive image techniques like Density Switching and Art Direction which helped in achieving a more responsive and mobile friendly version of the site which is compatible with majority of devices available in the market. Finally, a build pipeline was setup using npm scripts to handle tasks such as concatentation, compilation, prefixing and compressing to achieve a production ready code.</p>","excerpt":"Tour Agency Concept Website This project aims at developing a responsive e-commerce website of a tour company from scratch, using SASS. It…"}}]}}}